app/controllers/admins_controller.rb

INSERT INTO "admins" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '38ce7393ecf736ba09384d9841b5234727266a01', '2010-04-10 01:03:22', '043fbca76393d3f00f7b081bfa1cea9357b74941', NULL, '2010-04-10 01:03:22', NULL, 'admin', 'jaclynrbeck@gmail.com')
---
  def create
    logout_keeping_session!
    @admin = Admin.new(params[:admin])
    success = @admin && @admin.save