app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

SELECT * FROM "categories" WHERE ("categories"."id" = 3)
---
  def show
    @category = Category.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 3)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Nylons', '2010-03-06 22:08:26', '2010-03-06 22:08:26')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 3)
---
  def update
    @category = Category.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
DELETE FROM "categories" WHERE "id" = 4
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "items" WHERE ("items".category_id = 1)
---
  def showall
    @category = Category.find(params[:id])
    @items = @category.items.collect