app/controllers/images_controller.rb

    def create
      @image = Image.new(params[:image])

      respond_to do |format|
        if @image.save
---
INSERT INTO "images" ("size", "content_type", "thumbnail", "parent_id", "filename", "height", "main_image", "item_id", "width") VALUES(1946681, 'image/jpeg', NULL, NULL, 'daveandme.JPG', 1892, 't', 8, 1568)

    def destroy
      @image = Image.find(params[:id])
      @item = Item.find(@image.item_id)
      @image.destroy
---
SELECT * FROM "images" WHERE ("images".parent_id = 7)
SELECT * FROM "items" WHERE ("items"."id" = 8)
DELETE FROM "images" WHERE "id" = 8