app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM "items"

  def show
    @item = Item.find(params[:id])
    @purchase_message = Message.find(:first, :conditions => ["name = ?", 'Purchase Message'])
    @images = @item.images.collect
---
SELECT * FROM "items" WHERE ("items"."id" = 1)
SELECT * FROM "messages" WHERE (name = 'Purchase Message') LIMIT 1
SELECT * FROM "images" WHERE ("images".uploadable_id = 8 AND "images".uploadable_type = 'Item') ORDER BY created_at desc

  def edit
    @item = Item.find(params[:id])
    @images = @item.images.collect
---
SELECT * FROM "items" WHERE ("items"."id" = 4)
SELECT * FROM "images" WHERE ("images".uploadable_id = 8 AND "images".uploadable_type = 'Item') ORDER BY created_at desc

  def create
    @item = Item.new(params[:item])
    @vendors = Vendor.find(:all)
    @categories = Category.find(:all)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "price", "created_at", "size", "date_discontinued", "quantity", "updated_at", "bbl_id", "main_image_id", "category_id", "vendor_item_id", "description", "main_image", "vendor_id") VALUES('Pretty stuff', 200.0, '2010-05-05 23:14:13', '14', '2010-05-05 00:00:00', 1, '2010-05-05 23:14:13', 123345, NULL, 1, '23', 'This dress is purple.', NULL, 2)

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT * FROM "items" WHERE ("items"."id" = 4)
UPDATE "items" SET "updated_at" = '2010-04-27 23:54:31', "size" = '', "name" = 'blah', "vendor_item_id" = '123', "image_url" = '', "date_discontinued" = '2010-04-27 23:54:00', "vendor_id" = 1, "bbl_id" = 123, "description" = 'blah', "category_id" = 1 WHERE "id" = 18

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT * FROM "items" WHERE ("items"."id" = 1)
DELETE FROM "items" WHERE "id" = 1