app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM "messages"

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 2)

  def edit
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def update
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 2)