app/controllers/shop_controller.rb

SELECT "vendors".id FROM "vendors" WHERE ("vendors"."id" IS NULL) LIMIT 1
---
  def index
    @vendors = Vendor.find(:all)

SELECT * FROM "vendors" WHERE ("vendors"."id" = 1)
SELECT * FROM "items" WHERE ("items".vendor_id = 1)
SELECT * FROM "vendors"
---
  def vendor_browse
    @vendor = Vendor.find(params[:id])
    @items = @vendor.items.collect