app/controllers/shop_controller.rb

SELECT * FROM "messages" WHERE (name = 'Welcome Message') LIMIT 1
---
  def index
    @welcome_message = Message.find(:first, :conditions => ["name = ?", 'Welcome Message'])

SELECT * FROM "items" WHERE ("items"."id" = 8)
---
  def add_to_order
    @order = find_order
    item = Item.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 8)
---
  def remove_from_order
    @order = find_order
    item = Item.find(params[:id])

SELECT * FROM "vendors" WHERE ("vendors"."id" = 1)
SELECT * FROM "items" WHERE ("items".vendor_id = 1)
SELECT * FROM "vendors"
---
  def designer_browse
    @vendor = Vendor.find(params[:id])
    @items = @vendor.items.collect

SELECT * FROM "messages" WHERE (name = 'Designer Message') LIMIT 1
---
  def designer_list
    @vendors = Vendor.find(:all)
    @designer_message = Message.find(:first, :conditions => ["name = ?", 'Designer Message'])

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "categories"
SELECT * FROM "items" WHERE ("items".category_id = 1)
---
  def category_browse
    @category = Category.find(params[:id])
    @items = @category.items.collect