app/controllers/vendors_controller.rb

SELECT * FROM "vendors"
---
  def index
    @vendors = Vendor.all

SELECT * FROM "vendors" WHERE ("vendors"."id" = 3)
---
  def show
    @vendor = Vendor.find(params[:id])

SELECT * FROM "vendors" WHERE ("vendors"."id" = 3)
---
  def edit
    @vendor = Vendor.find(params[:id])

INSERT INTO "vendors" ("name", "created_at", "updated_at") VALUES('Casablanca', '2010-03-06 22:06:57', '2010-03-06 22:06:57')
---
  def create
    @vendor = Vendor.new(params[:vendor])

    respond_to do |format|
      if @vendor.save

SELECT * FROM "vendors" WHERE ("vendors"."id" = 3)
---
  def update
    @vendor = Vendor.find(params[:id])

SELECT * FROM "vendors" WHERE ("vendors"."id" = 1)
SELECT * FROM "items" WHERE ("items".vendor_id = 1)
---
  def showall
    @vendor = Vendor.find(params[:id])
    @items = @vendor.items.collect